number = input("숫자를 입력하세요: ")
print(number)
print(type(number))
print("=" * 50)
# ================================================================================================
number2 = int(input("숫자를 입력하세요: "))
print(number2)
print(type(number2))
print("=" * 50)
# ================================================================================================
print("life" "is" "too short")
print("life" + "is" + "too short")
print("=" * 50)
# ================================================================================================
for i in range(0, 10):
    print(i, end='')
