BRIGHT_BLUE = '\033[94m'
RESET = '\033[0m'

import pandas as pd
import numpy as np

print(f"{BRIGHT_BLUE}Series{RESET}")

data = np.array([1, 2, 3, 4])
index = ['a', 'b', 'c', 'd']

s = pd.Series(data=data, index=index)
print(s)
print("index:", s.index)
print("s['c']:", s['c'])
print("=" * 50)
# ================================================================================================
data = {'a': 1, 'b': 2, 'c': 3, 'd': 4}
s = pd.Series(data)
print(s)
print("=" * 50)
# ================================================================================================
print(f"{BRIGHT_BLUE}DataFrame{RESET}")

row1 = pd.Series([1, 2, 3, 4], ['a', 'b', 'c', 'd'])
row2 = pd.Series([5, 6, 7, 8], ['a', 'b', 'c', 'd'])
data = {0: row1, 1: row2}
df = pd.DataFrame(data)

print(df)
print(df.columns, df.index)
print("=" * 50)
# ================================================================================================
row1 = pd.Series([1, 2, 3, 4], ['a', 'b', 'c', 'd'])
row2 = pd.Series([5, 6, 7], ['x', 'y', 'z'])
data = {0: row1, 1: row2}
df = pd.DataFrame(data)

print(df)
print("=" * 50)
# ================================================================================================
data = {0: [1, 2, 3, 4], 1: [5, 6, 7, 8]}
df = pd.DataFrame(data)
print(df)
print("=" * 50)
# ================================================================================================
df = pd.DataFrame(
    [[1, 2, 3], [3, 4, 5]],
    index=['a', 'b'],  # 행
    columns=['x', 'y', 'z']  # 열
)
print(df)
print("=" * 50)
# ================================================================================================
print(f"{BRIGHT_BLUE}Indexing{RESET}")

df = pd.DataFrame(
    [[1, 2, 3], [3, 4, 5]],
    index=['a', 'b'],
    columns=['x', 'y', 'z']
)
print(df['x'])
print(df['y'])
print(df['z'])
print("=" * 50)
# ================================================================================================
print(df.at['a', 'x'])  # 하나의 변수만 반환
print(df.loc['a', 'x'])  # 하나의 열을 반환하는 등 여러 개의 변수를 한번에 반환
print("=" * 50)
# ================================================================================================
print(df.loc['b'])
print(df.loc[:, 'y'])
print(df.loc[['a', 'b'], ['y', 'z']])
print("=" * 50)
# ================================================================================================
df = pd.DataFrame(
    [[3, 2, 3], [3, 4, 5]],
    index=['a', 'b'],
    columns=['x', 'y', 'z']
)
rows = df['y'] > 2
print(rows)  # [False, True]
print(df.loc[rows])  # [False, True]이므로 a는 x, b만 반환
print("=" * 50)
# ================================================================================================
rows = (df['y'] > 1) & (df['x'] == 3)  # [True, True]
print(df.loc[rows])
print("=" * 50)
# ================================================================================================
df = pd.DataFrame(
    [[1, 2, 3], [3, 4, 5]],
    index=['a', 'b'],
    columns=['x', 'y', 'z']
)

# i가 붙으면 integer만 받음
print(df.iat[1, 2])  # 5
print(df.iloc[1, 2])  # 5
print(df.iloc[1])  # 3,4,5
print(df.iloc[:, 2])  # 3,5
print("=" * 50)
# ================================================================================================
df.loc['a'] = 7
print(df)
